function f_split(line) { // Метод split разбивает строку в массив
    arr_s = []; 		 // Создаём пустой массив
    tmp = "";			 // Временное хранилище элемента
    for (i = 0; i < line.length; i++) { // цикл перебирающий поступившую строку
        if (line[i] != " ") {  			// если i элемент не равен пробелу то присвоим его в tmp
            tmp += line[i];
        }
        else {
            if (tmp != '') arr_s.push(tmp); // иначе если элемент пробел, то добавим tmp в массив arr_s
            tmp = ""						// присваиваем tmp пустое значение
        }
    }
    return arr_s; 							// возвращаем заполненый массив
}

function f_map(arr_s) {		// метод map применяет действие для каждого элемента массив
    arr_n = [];				// Создаём пустой массив
    i = 0; 
    num = 0;
    while (i < Object.keys(arr_s).length) {	// цикл пока i меньше длины входного массива
      num = Number(arr_s[i]);				// присваиваем переменной num значение iтого элемента массива arr_s 
      arr_n[i] = num;						// передаём значение num iтому элементу новочо массива
      i++;									// увеличиваем i на 1
    }
  return arr_n;								// каждый элемент старого массива передали в новый 
}
function f_filter(arr_n) {					// метод filter фильтрует массив через функцию
	arr_f = [];								// новый массив
	for ( i = 0; i < Object.keys(arr_n).length; i++){		// пока не пройдём весь входящий массив
			if (arr_s[i] % 2 == 0) {						// проверяем делится ли элемент массива на 2 без остатка
				arr_f.push(arr_s[i]);						// добавлем этот элемент в новый массив
			}
	}
	return arr_f;
}
function f_sum(arr_f) {										// суммирование элементов массива
	sum = 0;
	tmp = 0;
	for ( i = 0; i < Object.keys(arr_f).length; i++) {		// пока не пройдём весь входящий массив
		tmp = Number(arr_f[i]);								// присваиваем значение во временную переменную
		sum += tmp;											// суммируем в переменную sum
		tmp = 0;
	}
	return sum;
}
line = "100 200      3 5 6 999 ";  // строка с целыми числами

// вызов написанных функций
arr_s = f_split(line); // строку в массив
arr_n = f_map(arr_s); // в массив чисел
arr_f = f_filter(arr_n); // отфильтровать
sum = f_sum(arr_f); // суммировать

// Вывод функций в консоль
console.log('Разделённая строка:', arr_s);
console.log('Коллекция чисел:', arr_n);
console.log('Фильтрованный массив:', arr_f);
console.log('Сумма чисел массива:',sum);
